Revit 2024 API
BuiltInFailures.FamilyFailures.FamilyConnectorDeletedWarning Property
 The family Connector has been modified so the connection is invalid.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static FailureDefinitionId FamilyConnectorDeletedWarning { get; }
Visual Basic
Public Shared ReadOnly Property FamilyConnectorDeletedWarning As FailureDefinitionId
	Get
Visual C++
public:
static property FailureDefinitionId^ FamilyConnectorDeletedWarning {
	FailureDefinitionId^ get ();
}
See Also
BuiltInFailures.FamilyFailures Class
Autodesk.Revit.DB Namespace